Revit 2027 API
ExternalResourceMatchOptions.ResourceType Property
 The desired resource type which external resources should match.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceType ResourceType { get; }
Public ReadOnly Property ResourceType As ExternalResourceType
	Get
public:
property ExternalResourceType^ ResourceType {
	ExternalResourceType^ get ();
}
member ResourceType : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace